note/2020/safari’s-new-clipper/index.org
#+SETUPFILE: ../../setup.org
#+TITLE: Safari’s New Clipper
#+DATE: <2020-04-23 Thu 10:22>
#+TAGS: Efficency Apple

For the longest time I’ve wanted a web clipper that doesn’t suck—one that saves to local files, can do everything in one click, and clips well. I’ve been saving web pages to PDF and dragging them to Note.app for quite a while after ditching Evernote. Needless to say, that’s the ad-hoc-ist workflow one can imagine. I was going to write a share extension for Safari but never took action.

Guess what—no need for that anymore. In some past updates Apple quietly added a “Add to Books” share extension to Safari, and it is everything I’ve dreamed for. I even think I can forgive Apple for their crappy Music app and buggy updates (not really, no). The extension creates a long, beautiful PDF, faithfully rendered according to the web page. No weird layout problems, no page breaks, it just works.

I clipped one of my blog posts to PDF, so you can have a look: [[./example.pdf]].

