note/2020/safari’s-new-clipper/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-23 Thu 10:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Safari’s New Clipper</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up-index-page">
<div>
<a accesskey="h" href="../../index.html"> UP </a> |
<a accesskey="H" href="../../index.html"> HOME </a>
</div>
<div>
<a href="../rss.xml"> RSS </a> |
<a href="https://github.com/casouri/casouri.github.io"> Source </a> |
<a href="https://creativecommons.org/licenses/by-sa/4.0/"> License </a>
</div>
</div><div id="content">
<h1 class="title">Safari’s New Clipper</h1>
<p>
For the longest time I’ve wanted a web clipper that doesn’t suck—one that saves to local files, can do everything in one click, and clips well. I’ve been saving web pages to PDF and dragging them to Note.app for quite a while after ditching Evernote. Needless to say, that’s the ad-hoc-ist workflow one can imagine. I was going to write a share extension for Safari but never took action.
</p>

<p>
Guess what—no need for that anymore. In some past updates Apple quietly added a “Add to Books” share extension to Safari, and it is everything I’ve dreamed for. I even think I can forgive Apple for their crappy Music app and buggy updates (not really, no). The extension creates a long, beautiful PDF, faithfully rendered according to the web page. No weird layout problems, no page breaks, it just works.
</p>

<p>
I clipped one of my blog posts to PDF, so you can have a look: <a href="./example.pdf">./example.pdf</a>.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Written by Yuan Fu <<a href="mailto:casouri@gmail.com">casouri@gmail.com</a>></p>
<p class="first-publish">First Published on 2020-04-23 Thu 10:22</p>
<p class-"last-modified">Last modified on 2020-04-23 Thu 10:50</p>
</div>
</body>
</html>
